JobPortal/app/Http/Controllers/AccountController.php

select * from `users` where `id` = 4 limit 1
---
    public function profile(){

        // here we will get user id, which user logged in
        $id = Auth::user()->id;
        $user = User::where('id',$id)->first();

select * from `users` where `users`.`id` = 2 limit 1
---
     public function updateProfile(Request $request){

        $id = Auth::user()->id;

        $validator = Validator::make($request->all(),[
            'name' => 'required|min:5|max:20',
            'email' => 'required|email|unique:users,email,'.$id.',id'
        ]);

        if($validator->passes()){

            $user = User::find($id);

update `users` set `image` = '4-1734580886.jpg', `users`.`updated_at` = '2024-12-19 04:01:26' where `id` = 4
---
    public function updateProfileImg(Request $request){

        $id = Auth::user()->id;

        $validator = Validator::make($request->all(),[
            'image' => 'required|image'
        ]);
        if($validator->passes()){
            $image = $request->image;
            $ext = $image->getClientOriginalExtension();
            $imageName = $id.'-'.time().'.'.$ext;
            $image->move(public_path('/profile_img/'), $imageName);

            //Create Thumbnail
            $sourcePath = public_path('/profile_img/'.$imageName);
            $manager = new ImageManager(Driver::class);
            $image = $manager->read($sourcePath);

            // crop the best fitting 5:3 (600x360) ratio and resize to 600x360 pixel
            $image->cover(150, 150);
            $image->toPng()->save(public_path('/profile_img/thumb/'.$imageName));

            //Delete old profile images

            File::delete(public_path('/profile_img/thumb/'.Auth::user()->image));
            File::delete(public_path('/profile_img/'.Auth::user()->image));


            User::where('id',$id)->update(['image'=>$imageName]);

select * from `categories` where `status` = 1 order by `name` asc
select * from `job_types` where `status` = 1 order by `name` asc
---
    public function createJob(){
        $categories = Category::orderBy('name','ASC')->where('status',1)->get();
        $job_types = JobType::orderBy('name','ASC')->where('status',1)->get();

select * from `job_types` where `job_types`.`id` in (1, 2, 3, 4, 5)
---
        public function myJobs(){

            $jobs = Job::where('user_id',Auth::user()->id)->with('jobType')->orderBy('created_at','DESC')->paginate(10);

select * from `job_applications` where `user_id` = 3 order by `created_at` desc limit 10 offset 0
select * from `job_types` where `job_types`.`id` in (3)
select count(*) as aggregate from `job_applications` where `user_id` = 3
---
    public function myJobApplications(){

        $jobApplications = JobApplication::where('user_id',Auth::user()->id)->with(['job','job.jobType','job.applications'])->orderBy('created_at','DESC')->paginate(10);

select * from `job_applications` where `user_id` = 2 order by `created_at` desc limit 10 offset 0
---
    public function removeJobs(Request $request){

        $jobApplication = JobApplication::where([
                                    'id' => $request->id,
                                    'user_id' => Auth::user()->id,]
                                )->first();

select count(*) as aggregate from `job_applications` where `user_id` = 2
select * from `job_applications` where `job_applications`.`job_id` in (1, 8)
select * from `job_types` where `job_types`.`id` in (2, 4)
select * from `saved_jobs` where (`user_id` = 1) order by `created_at` desc limit 10 offset 0
---
    public function savedJobs(){
        $savedJobs = SavedJob::where([
            'user_id' => Auth::user()->id,
        ])->with(['job','job.jobType','job.applications'])->orderBy('created_at','DESC')->paginate(10);

select * from `saved_jobs` where (`user_id` = 2) order by `created_at` desc limit 10 offset 0
---
        public function removeSavedJob(Request $request){

            $savedJob = SavedJob::where([
                                        'id' => $request->id,
                                        'user_id' => Auth::user()->id,]
                                    )->first();