JobPortal/app/Http/Controllers/JobsController.php

        public function jobDetail($id){

            $job = Job::where([
                            'id' => $id,
                            'status' => 1
                        ])->with(['jobType','category'])->first();
---
select * from `categories` where `categories`.`id` in (4, 9, 10, 12, 15, 18, 19, 20)
select * from `job_types` where `job_types`.`id` in (1, 2, 3, 5)