JobPortal/app/Http/Controllers/JobsController.php

        public function index(Request $request){

            $categories = Category::where('status',1)->get();
            $jobTypes = JobType::where('status',1)->get();
---
select * from `categories` where `status` = 1
select * from `job_types` where `status` = 1

        public function jobDetail($id){

            $job = Job::where([
                            'id' => $id,
                            'status' => 1
                        ])->with(['jobType','category'])->first();

            if($job == null){
                abort(404);
            }

            $count = 0;
            if(Auth::user()){
                $count = SavedJob::where([
                    'user_id' => Auth::user()->id,
                    'job_id' => $id,
                ])->count();
            }

            // fetch applicants
            $applications = JobApplication::where('job_id', $id)->with('user')->get();
---
select * from `categories` where `categories`.`id` in (14)
select * from `job_types` where `job_types`.`id` in (4)
select count(*) as aggregate from `saved_jobs` where (`user_id` = 1 and `job_id` = '3')
select * from `job_applications` where `job_id` = '3'
select * from `users` where `users`.`id` in (1)

    public function applyJob(Request $request){
        $id = $request->id;

        $job = Job::where('id',$id)->first();

        // If job not found
        if($job == null){
            $message = "Job does not exist";
            Session()->flash('error',$message);
            return response()->json([
                'status' => false,
                'message' => $message,
            ]);
        }

        // You can't apply on your own job
        $employer_id = $job->user_id;
        if($employer_id == Auth::user()->id){
            $message = "You can not apply on your own job";
            Session()->flash('error',$message);
            return response()->json([
                'status' => false,
                'message' => $message,
            ]);
        }

        // User can't apply on a job twise
        $jobApplicationCount = JobApplication::where([
            'user_id' => Auth::user()->id,
            'job_id' => $id,
        ])->count();
---
select count(*) as aggregate from `job_applications` where (`user_id` = 1 and `job_id` = '4')

        $application->user_id = Auth::user()->id;
        $application->employer_id = $employer_id;
        $application->applied_date = now();
        $application->save();

        // Send notification email to employer
        $employer = User::where('id',$employer_id)->first();
---
insert into `job_applications` (`job_id`, `user_id`, `employer_id`, `applied_date`, `updated_at`, `created_at`) values ('4', 1, 2, '2024-12-18 13:57:18', '2024-12-18 13:57:18', '2024-12-18 13:57:18')
select * from `users` where `id` = 2 limit 1