JobPortal/app/Http/Controllers/admin/CategoryController.php

    public function index(){
        $categories = Category::orderBy('name','DESC')->paginate(8);
---
select * from `categories` order by `name` desc limit 8 offset 0
select count(*) as aggregate from `categories`

    public function edit($id){

        $category = Category::findorFail($id);
---
select * from `categories` where `categories`.`id` = '4' limit 1

    public function update(Request $request,$id){

        $validator = Validator::make($request->all(),[
            'name' => 'required',
        ]);
        if($validator->passes()){
            $category = Category::find($id);
---
select * from `categories` where `categories`.`id` = '4' limit 1

    public function save(Request $request){
        $validator = Validator::make($request->all(),[
            'name' => 'required',
        ]);

        if($validator->passes()){
            $category = new Category;
            $category->name = $request->name;
            $category->status = $request->status;
            $category->save();
---
insert into `categories` (`name`, `status`, `updated_at`, `created_at`) values ('Test', '1', '2025-01-19 15:35:43', '2025-01-19 15:35:43')