JobPortal/app/Http/Controllers/admin/JobController.php

select * from `job_applications` where `job_applications`.`job_id` in (47, 48, 49, 50, 51, 52, 53, 54, 55, 56)
select * from `users` where `users`.`id` in (1, 2, 3)
select * from `categories` where `status` = 1 order by `name` asc
select * from `job_types` where `status` = 1 order by `name` asc
---
    public function index(){

        $jobs = Job::orderBy('created_at','DESC')->with('user','applications')->paginate(10);
        return view('admin.jobs.list',[
            'jobs' => $jobs,
        ]);
    }


    public Function edit($id){

        $job = Job::findOrFail($id);
        $categories = Category::orderBy('name','ASC')->where('status',1)->get();
        $job_types = JobType::orderBy('name','ASC')->where('status',1)->get();