JobPortal/app/Http/Controllers/admin/JobTypeController.php

select * from `job_types` order by `name` desc limit 8 offset 0
select count(*) as aggregate from `job_types`
---
    public function index(){
        $job_types = JobType::orderBy('name','DESC')->paginate(8);

select * from `job_types` where `job_types`.`id` = '2' limit 1
---
    public function edit($id){

        $job_type = JobType::findOrFail($id);

select * from `job_types` where `job_types`.`id` = '7' limit 1
---
    public function update(Request $request, $id){

        $job_type = JobType::find($id);